Autodesk.Navisworks.Api.ModelItemCollection
A collection of ModelItems. Often used to represent an explicit selection

Autodesk.Navisworks.Api.ModelItemCollection.#ctor
Create an empty collection

Autodesk.Navisworks.Api.ModelItemCollection.#ctor(Autodesk.Navisworks.Api.ModelItemCollection)
Create a copy of another collection
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed
Throws System.ArgumentException:
Argument 'from' is associated with a different document

Autodesk.Navisworks.Api.ModelItemCollection.Add(Autodesk.Navisworks.Api.ModelItem)
Adds an item to the .
item: The object to add to the .
Throws System.NotSupportedException: The  is read-only.

Autodesk.Navisworks.Api.ModelItemCollection.AddAllInstances
Add all instances of items included in the selection
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.ModelItemCollection.AddRange(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem})
Add the items of the specified collection to the ModelItemCollection
from: The collection to add items from

Autodesk.Navisworks.Api.ModelItemCollection.AreAllInstancesSelected
Are all instances of items included in the selection also in the selection?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItemCollection.BoundingBox
Calculates bounding box of all items contained in the selection
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItemCollection.BoundingBox(System.Boolean)
Calculates bounding box of all items contained in the selection
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItemCollection.Clear
Removes all items from the .
Throws System.NotSupportedException: The  is read-only.

Autodesk.Navisworks.Api.ModelItemCollection.Contains(Autodesk.Navisworks.Api.ModelItem)
Determines whether the Selection contains a specific value.
item: The ModelItem to locate in the Selection.
Returns: true if item is found in the Selection; otherwise, false.

Autodesk.Navisworks.Api.ModelItemCollection.CopyFrom(Autodesk.Navisworks.Api.ModelItemCollection)
Sets the contents of the collection to the items in from
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed
Throws System.ArgumentException:
Argument 'from' is associated with a different document

Autodesk.Navisworks.Api.ModelItemCollection.CopyFrom(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem})
Sets the contents of the collection to the items in from
from: The collection to copy contents from

Autodesk.Navisworks.Api.ModelItemCollection.CopyTo(Autodesk.Navisworks.Api.ModelItem[],System.Int32)
Copies the elements of the  to an , starting at a particular  index.
array: The one-dimensional  that is the destination of the elements copied from . The  must have zero-based indexing.
arrayIndex: The zero-based index in array at which copying begins.
Throws System.ArgumentOutOfRangeException: arrayIndex is less than 0.
Throws System.ArgumentNullException: array is null.
Throws System.ArgumentException: array is multidimensional.-or-arrayIndex is equal to or greater than the length of array.-or-The number of elements in the source  is greater than the available space from arrayIndex to the end of the destination array.-or-Type T cannot be cast automatically to the type of the destination array.

Autodesk.Navisworks.Api.ModelItemCollection.CopyTo(System.Collections.Generic.ICollection{Autodesk.Navisworks.Api.ModelItem})
Copies the contents of the collection into to
to: The collection to copy contents into

Autodesk.Navisworks.Api.ModelItemCollection.Count
Gets the number of elements contained in the collection.

Autodesk.Navisworks.Api.ModelItemCollection.Descendants
All descendants of the items in the collection (excluding the items themselves)

Autodesk.Navisworks.Api.ModelItemCollection.DescendantsAndSelf
All descendants of the items in the collection (including the items themselves)

Autodesk.Navisworks.Api.ModelItemCollection.First
Return the first item in the collection or null if empty
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItemCollection.GetEnumerator
Returns an enumerator that can iterate through the collection.
Returns: An IEnumerator that can be used to iterate through the collection.

Autodesk.Navisworks.Api.ModelItemCollection.Invert(Autodesk.Navisworks.Api.Document)
Inverts the selection.
doc: The document to invert the selection relative to.
Should be the same document that you got the original collection from.
Throws System.ArgumentNullException:
Argument 'doc' in null

Autodesk.Navisworks.Api.ModelItemCollection.IsAnyContained(Autodesk.Navisworks.Api.ModelItemCollection)
Is any item in sel contained in selection? Are any items in value contained in any of the items in this selection?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'value' is null
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.ModelItemCollection.IsContained(Autodesk.Navisworks.Api.ModelItem)
Is item contained in selection? Item must be contained in any of the items in this selection
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' has been Disposed

Autodesk.Navisworks.Api.ModelItemCollection.IsContained(Autodesk.Navisworks.Api.ModelItemCollection)
Is sel contained in selection? Are all items in value contained in any of the items in this selection?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'value' is null
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.ModelItemCollection.IsContentsIntersected(Autodesk.Navisworks.Api.ModelItemCollection)
Are any paths contained by this selection also contained by value?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'value' is null
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.ModelItemCollection.IsDisjoint
Is no item contained by any other item?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItemCollection.IsEmpty
Does the collection represent nothing selected?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.ModelItemCollection.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.ModelItemCollection.IsSelected(Autodesk.Navisworks.Api.ModelItem)
Is item a member of this selection?
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' has been Disposed

Autodesk.Navisworks.Api.ModelItemCollection.IsSelected(Autodesk.Navisworks.Api.ModelItemCollection)
Is value a subset of this selection? All paths in value must also be in this selection
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'value' is null
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.ModelItemCollection.Item(System.Int32)


Autodesk.Navisworks.Api.ModelItemCollection.MakeDisjoint
Remove any selected items that are contained by other items
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.ModelItemCollection.Minimize
Replaces this selection by one which contains the same items as this one does while including the minimum number of items.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.ModelItemCollection.Remove(Autodesk.Navisworks.Api.ModelItem)
Removes the first occurrence of a specific ModelItem from the Selection.
item: The object to remove from the Selection.
Returns: true if item was successfully removed from the Selection; otherwise, false. This method also returns false if item is not found in the original Selection.
Throws System.NotSupportedException: The Selection is read-only.

Autodesk.Navisworks.Api.ModelItemCollection.ValueEquals(Autodesk.Navisworks.Api.ModelItemCollection)
Performs comparison 'By Value'

Autodesk.Navisworks.Api.ModelItemCollection.ValueEquals(Autodesk.Navisworks.Api.ModelItemCollection,Autodesk.Navisworks.Api.ModelItemCollection)
Compares the two references 'By Value'

Autodesk.Navisworks.Api.ModelItemCollection.Where(Autodesk.Navisworks.Api.SearchCondition)
Filters the items based on a search condition

Autodesk.Navisworks.Api.ModelItemCollection.Where(Autodesk.Navisworks.Api.SearchConditionCollection)
Filters the items based on a set of search conditions